---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELZInOption
source: html/46a905ed-ba71-1601-8fff-0c27e533c48f.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DesignOptionFailures.CannotPutELZInOption Property

Area Based Loads must be in the Main Model.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPutELZInOption { get; }
```